Repository: damix00/taskbuddy-flutter
Catalog: lib/l10n/app_*.arb
Languages: hr

# registerBtn
source: Sign up
hr: Registriraj se

# loginBtn
source: Log in
hr: Prijavi se

source: (optional)
hr: (neobavezno)

# welcome__s1_title
source: Welcome to TaskBuddy.
hr: Dobrodošli na TaskBuddy.

# welcome__s1_desc
source: Your platform for easily doing and posting jobs.
hr: Vaša platforma za jednostavno obavljanje i objavljivanje poslova.

# welcome__s2_title
source: Post a job.
hr: Objavi posao.

# welcome__s2_desc
source: Our powerful algorithm and magical search will find the perfect worker for your job. Post a job and witness a wonder of the world!
hr: Naš moćni algoritam i čarobni search pronaći će savršenog TaskBuddyja za tvoj posao. Objavi posao i prisustvuj svjetskom čudu!

# welcome__s3_title
source: Discover jobs.
hr: Otkrij poslove.

# welcome__s3_desc
source: 1. Scroll through an endless number of jobs. 2. Do amazing jobs and earn money. 3. ??? 4. PROFIT!
hr: 1. Listajte kroz beskrajan broj poslova. 2. Radi nevjerojatne poslove i zarađuj. 3. ??? 4. PROFIT!

# loginDesc
source: Welcome back to TaskBuddy - where your to-do list meets its match.
hr: Dobrodošli natrag u TaskBuddy - gdje vaš popis obveza susreće svog para.

source: Password
hr: Lozinka

# dontHaveAccount
source: Don''t have an account?
hr: Nemate račun?

# alreadyHaveAccount
source: Already have an account?
hr: Već imate račun?

source: Forgot password?
hr: Zaboravili ste lozinku?

# emptyField
source: {field} cannot be empty.
hr: Polje ''{field}'' ne smije biti prazno.

# invalidEmail
source: Invalid E-Mail address
hr: Neispravan E-Mail

# passwordTooShort
source: Password must be at least {minLength} characters long.
hr: Lozinka mora imati najmanje {minLength} znakova.

# passwordTooLong
source: Password must be at most {maxLength} characters long.
hr: Lozinka ne može imati više od {maxLength} znakova.

# passwordMustContainNumber
source: Password must contain at least one number.
hr: Lozinka mora sadržavati barem jedan broj.

# invalidCredentials
source: Invalid E-Mail address or password.
hr: Neispravan E-Mail ili lozinka.

source: Internal server error.
hr: Došlo je do pogreške na serveru.

source: Request timed out.
hr: Zahtjev je istekao.

# registerTitle
source: Chores. Community. Let''s go!
hr: Poslovi. Zajednica. Krenimo!

# registerDesc
source: Embrace collaboration and convenience - sign up for TaskBuddy today!
hr: Prihvatite suradnju i praktičnost - registrirajte se za TaskBuddy danas!

# continueText
source: Continue
hr: Nastavi

# termsAndConditions
source: I agree with the <link href="{url}">Terms and Conditions</link>.
hr: Slažem se s <link href="{url}">Uvjetima pružanja usluge</link>.

# registerCredentialsAppbar
source: Account setup
hr: Postavljanje računa

# registerCredentialsTitle
source: Account credentials
hr: Podaci za prijavu

# registerCredentialsDesc
source: Your secure gateway: choose your E-Mail and password.
hr: Tvoj siguran prolaz: odaberi svoj E-Mail i lozinku.

source: Confirm password
hr: Potvrdi lozinku

source: Passwords don''t match.
hr: Lozinke se ne podudaraju.

# emailTaken
source: E-Mail address already taken.
hr: E-Mail je već zauzet.

# networkError
source: A network error occurred.
hr: Došlo je do pogreške u mreži.

source: Phone number
hr: Broj mobitela

# phoneNumberTaken
source: Phone number already taken.
hr: Broj mobitela je već zauzet.

source: Invalid phone number.
hr: Neispravan broj mobitela.

# registerDetailsAppbar
source: Profile details
hr: Detalji profila

# registerDetailsTitle
source: Profile details
hr: Detalji profila

# registerDetailsDesc
source: Tell us a bit about yourself.
hr: Reci nam nešto o sebi.

source: First name
hr: Ime

source: Last name
hr: Prezime

source: Username
hr: Korisničko ime

# usernameTooltip
source: This is your unique identifier, and it can be changed later if needed. Choose a name that represents you best. You can change your username only once every 30 days.
hr: Ovo je tvoj jedinstveni identifikator, a može se promijeniti kasnije ako je potrebno. Odaberite ime koje vas najbolje predstavlja. Korisničko ime možete promijeniti samo jednom u 30 dana.

# usernameTooShort
source: Username must be at least {minLength} characters long.
hr: Korisničko ime mora imati najmanje {minLength} znakova.

# usernameTooLong
source: Username must be at most {maxLength} characters long.
hr: Korisničko ime ne može imati više od {maxLength} znakova.

# usernameTaken
source: Username already taken.
hr: Korisničko ime je već zauzeto.

source: Invalid username.
hr: Neispravno korisničko ime.

# profileDisclaimer
source: This data will be visible to everyone. You can change this later.
hr: Ovi će podaci biti vidljivi svima. Možete ih promijeniti kasnije.

# finalRegisterAppbar
source: Finish up
hr: Dovrši registraciju

# finalRegisterTitle
source: Perfect your profile
hr: Usavrši svoj profil

# finalRegisterDesc
source: Add a profile picture and a short bio to make your profile stand out.
hr: Dodaj profilnu sliku i kratku biografiju kako bi tvoj profil bio uočljiviji.

source: Profile picture
hr: Profilna slika

source: Biography
hr: Biografija

# bioPlaceholder
source: e.g. "22, studying at MIT, gamer"
hr: npr. "22, studiram na FER-u, volim programirati"

# signUpBtnFinish
source: Sign up!
hr: Registriraj se!

source: Take photo
hr: Uslikaj fotografiju

source: Choose from gallery
hr: Odaberi iz galerije

source: Remove
hr: Ukloni

source: Crop image
hr: Izreži sliku

source: Cancel
hr: Odustani

source: Done
hr: Gotovo

source: Followers
hr: Pratitelji

source: Following
hr: Prati

source: Edit profile
hr: Uredi profil

source: Listings
hr: Objave

source: Reviews
hr: Recenzije

source: Jobs done
hr: Obavljeno

# cancellationRate
source: {rate}% cancellation rate
hr: {rate}% otkazivanja

source: Employer rating
hr: Ocjena kao poslodavac

source: Employee rating
hr: Ocjena kao radnik

source: Settings
hr: Postavke

# helpAndSupport
source: Help & Support
hr: Pomoć i podrška

source: Share profile
hr: Podijeli profil

source: History
hr: Povijest

source: Saved
hr: Spremljeno

source: General
hr: Općenito

source: Account
hr: Račun

source: Privacy
hr: Privatnost

source: Security
hr: Sigurnost

source: Appearance
hr: Izgled

# appearanceAndAccessibility
source: Appearance & Accessibility
hr: Izgled i pristupačnost

source: Language
hr: Jezik

source: Social
hr: Društveno

source: Friends
hr: Prijatelji

source: Blocked users
hr: Blokirani korisnici

source: Interests
hr: Interesi

# interestsDesc
source: Tell us what you''re interested in so we can show you the most relevant content.
hr: Odaberite kategorije koje vas zanimaju kako bismo vam mogli prikazati relevantne poslove.

source: Application
hr: Aplikacija

source: Other
hr: Ostalo

source: Open source licenses
hr: Licence otvorenog koda

source: Notifications
hr: Obavijesti

source: Log out
hr: Odjava

source: Account information
hr: Informacije o računu

# outdatedApp
source: Your app is outdated. Please update it to the latest version to continue using it.
hr: Vaša je verzija aplikacija zastarjela. Molimo vas da ju ažurirate kako biste ju nastavili koristiti.

source: Verify phone number
hr: Potvrdite broj mobitela

# verifyPhoneNumberDesc
source: In order to use TaskBuddy, you need to verify your phone number.
hr: Kako biste mogli koristiti TaskBuddy, morate potvrditi svoj broj mobitela.

source: Verification code
hr: Kod za potvrdu

source: Enter verification code
hr: Unesite kod za potvrdu

# enterVerificationCodeDesc
source: We''ve sent a verification code to your phone number. Please enter it below to verify your phone number.
hr: Poslali smo vam SMS s kodom za potvrdu. Unesite ga u polje ispod kako biste potvrdili svoj broj mobitela.

source: Verify
hr: Potvrdi

source: Resend code
hr: Pošalji ponovno

# resendCodeIn
source: Resend code in {seconds} seconds
hr: Pošalji ponovno za {seconds} sekundi

source: Invalid verification code.
hr: Neispravan kod za potvrdu.

source: Verification code expired.
hr: Kod za potvrdu je istekao.

source: Verification code sent.
hr: Kod za potvrdu je poslan.

# callInstead
source: Call me instead
hr: Nazovi me umjesto toga

source: Verification successful!
hr: Potvrda uspješna!

# offlineWarning
source: You are offline. Some features may not work properly.
hr: Niste povezani na mrežu. Neke značajke možda neće ispravno raditi.

# changePfp
source: Change profile picture
hr: Promijeni profilnu sliku

source: Something went wrong.
hr: Nešto je pošlo po zlu.

# successfullyChangedPfp
source: Successfully changed profile picture!
hr: Profilna slika uspješno promijenjena!

source: UI Blur
hr: Zamagljivanje sučelja

# uiBlurDesc
source: Disabling UI blur will improve performance on older devices.
hr: Isključivanje zamagljivanja može poboljšati performanse na starijim uređajima.

source: Advanced
hr: Napredno

source: Theme
hr: Tema

source: System
hr: Sustav

source: Light
hr: Svijetlo

source: Dark
hr: Tamno

source: Profile
hr: Profil

source: Location
hr: Lokacija

# locationTooltipProfile
source: If your profile is public, your location will be visible to everyone. Otherwise, it will be visible only to your followers.
hr: Ako je Vaš profil javan, Vaša će lokacija biti vidljiva svima. Inače, bit će vidljiva samo vašim pratiteljima.

# approximateLocation
source: We will only show your approximate location, and the name of your town.
hr: Prikazat ćemo samo vašu približnu lokaciju, i ime vašeg mjesta.

source: Discard
hr: Odbaci

# popupEditProfileCancelTitle
source: Discard changes?
hr: Odbaciti promjene?

# popupEditProfileCancelDesc
source: Are you sure you want to discard your changes?
hr: Jeste li sigurni da želite odbaciti promjene?

source: Pinned location
hr: Označena lokacija

source: Change
hr: Promijeni

source: Unnamed location
hr: Nepoznata lokacija

source: No location provided
hr: Lokacija nije navedena

source: Choose location
hr: Odaberi lokaciju

# searchPlaceholder
source: Search locations, adresses...
hr: Pretraži lokacije, adrese...

source: No results
hr: Nema rezultata

source: Successfully changed!
hr: Uspješno promijenjeno!

# locationOff
source: Your location is off or unavailable.
hr: Vaša lokacija je isključena ili nedostupna.

source: New post
hr: Nova objava

source: Choose type of job
hr: Odaberi vrstu posla

# chooseTypeOfJobDesc
source: Which type of services do you require?
hr: Koju vrstu usluge trebate?

source: Type of job
hr: Vrsta posla

source: One-time job
hr: Jednokratni posao

# oneTimeJobDesc
source: One-time jobs are jobs that are done only once, e.g. cleaning your car, washing the dishes...
hr: Jednokratni poslovi su poslovi koji se obavljaju samo jednom, npr. čišćenje automobila, pranje posuđa...

source: Part-time job
hr: Posao na pola radnog vremena

# partTimeJobDesc
source: Part-time jobs are real jobs that are done part-time, e.g. cashier, waiter, babysitter..
hr: Poslovi na pola radnog vremena su pravi poslovi koji se obavljaju na pola radnog vremena, npr. blagajnik, konobar, dadilja...

source: Full-time job
hr: Posao na puno radno vrijeme

# fullTimeJobDesc
source: Full-time jobs are real jobs that are done on a regular basis, e.g. developer, teacher, doctor...
hr: Poslovi na puno radno vrijeme su pravi poslovi koji se obavljaju redovito, npr. programer, učitelj, liječnik...

source: Urgent?
hr: Hitno?

# urgentDesc
source: Urgent jobs expire sooner, but are pushed more by the algorithm.
hr: Hitni poslovi ističu brže, ali ih algoritam više preporučuje.

# chooseLocationDesc
source: Where is the job located?
hr: Gdje se posao treba obaviti?

source: It has a location
hr: Ima lokaciju

# itHasALocationDesc
source: Specify the location of the job. We will only show an approximate location to protect your privacy.
hr: Odredite lokaciju posla. Prikazat ćemo samo približnu lokaciju kako bismo zaštitili vašu privatnost.

source: It doesn''t have a location
hr: Nema lokaciju

# itDoesntHaveALocationDesc
source: Does not have a specific location, and can be done anywhere.
hr: Nema određenu lokaciju i može se obaviti bilo gdje.

source: Suggestion radius
hr: Udaljenost preporuke

# suggestionRadiusDesc
source: How far do you want to search for potential workers?
hr: Koliko daleko želite tražiti potencijalne radnike?

# notResponsibleNote
source: Note: We are not responsible for any theft, damage or other problems that may occur.
hr: Napomena: Nismo odgovorni za bilo kakvu krađu, oštećenje ili druge probleme koji se mogu pojaviti.

# chooseTitleAndDesc
source: Choose title & description
hr: Odaberi naslov i opis

# chooseTitleAndDescSub
source: Your title will show up in the feed and the first line of your description will aswell.
hr: Vaš će se naslov pojaviti u feedu, kao i prvi redak vašeg opisa.

source: Title
hr: Naslov

# titlePlaceholder
source: e.g. "Need help with cleaning my car"
hr: npr. "Trebam nekoga da mi očisti auto"

source: Description
hr: Opis

# descriptionPlaceholder
source: e.g. "I need someone to clean my car. I don''t have time to do it myself, and I''m willing to pay 10€ for it."
hr: npr. "Trebam nekoga da mi očisti auto. Nemam vremena to učiniti sam, a spreman sam platiti 10€ za to."

source: Add media
hr: Dodaj medije

# addMediaDesc
source: Add some images or videos which describe your job. The first item will be used as the cover.
hr: Dodajte neke slike ili videozapise koji opisuju vaš posao. Prvi će se element prikazati u feedu.

# tapToAddImage
source: Tap to take or choose an image or a video.
hr: Dodirnite za odabir slike ili videa

source: Edit
hr: Uredi

source: Add more
hr: Dodaj još

source: Edit media
hr: Uredi medije

# selectStartEnd
source: Select start and end date
hr: Odaberi početni i završni datum

# selectStartEndDesc
source: Choose when the job is going to be available and when it expires. If the post is marked as urgent, you have a maximum of 7 days.
hr: Odaberite kada će posao biti dostupan i kada ističe. Ako je objava označena kao hitna, ističe 7 dana nakon objave.

source: Choose price
hr: Odaberi cijenu

# choosePriceDesc
source: How much are you willing to pay for this job?
hr: Koliko ste spremni platiti za ovaj posao?

source: Haptic feedback
hr: Taktilna povratna informacija

source: Start date
hr: Početni datum

source: End date
hr: Završni datum

source: Price
hr: Cijena

# pricePlaceholder
source: e.g. "10€"
hr: npr. "10€"

source: Invalid number
hr: Neispravan broj

# numRange
source: Number must be between {min} and {max}.
hr: Broj mora biti između {min} i {max}.

# mustChooseLocation
source: You must choose a location.
hr: Morate odabrati lokaciju.

source: Choose tags
hr: Odaberi oznake

# chooseTagsDesc
source: Choose tags that describe your job. This will help us find the perfect worker for your job. You must choose between {min} and {max} tags.
hr: Odaberite oznake koje najbolje opisuju vaš posao. Ove će oznake pomoći drugim korisnicima da pronađu vaš posao. Morate odabrati između {min} i {max} oznaka.

source: Review your post
hr: Pregledajte svoju objavu

# reviewYourPostDesc
source: Make sure everything is correct before posting. If you''re ready, post it!
hr: Pregledajte svoju objavu prije nego što je objavite. Ako ste spremni, objavite je!

source: Yes
hr: Da

source: No
hr: Ne

source: Remote
hr: Udaljeno

source: Media
hr: Mediji

source: View
hr: Pregled

source: Tags
hr: Oznake

# postBtn
source: Post!
hr: Objavi!

# postTitle
source: Post
hr: Objava

source: Follow
hr: Prati

# locationPermissionTitle
source: Location permission
hr: Dopustite pristup lokaciji

# locationPermissionDesc
source: Do you want to allow TaskBuddy to access your location? This will allow us to show you jobs near you.
hr: Da bismo vam mogli prikazati poslove u vašoj blizini, morate nam dopustiti pristup vašoj lokaciji.

source: Send a message
hr: Pošalji poruku

# urgentText
source: Urgent
hr: Hitno

source: Tap to read more
hr: Dodirnite da vidite više

source: Views
hr: Pregledi

source: Likes
hr: Lajkovi

source: Comments
hr: Komentari

source: Shares
hr: Dijeljenja

source: Bookmarks
hr: Spremljenih
